app/Controllers/AchatController.php

SELECT *
FROM `produit`
---
    public function saisie()
    {
        $produitModel = new ProduitModel();

        $session = session();

        // panier stocké en session
        $panier = $session->get('panier') ?? [];

        $listProduits = $produitModel->findAll();

SELECT *
FROM `produit`
WHERE `produit`.`id` = '1'
---
    public function addToCart()
    {
        $session = session();
        $produitModel = new ProduitModel();

        $idProduit = $this->request->getPost('id_produit');
        $quantite = (int) $this->request->getPost('quantite');

        $produit = $produitModel->find($idProduit);

SELECT `achat`.`id`, `achat`.`montant_total`, `caisse`.`numero`, `user`.`email`
FROM `achat`
JOIN `caisse` ON `caisse`.`id` = `achat`.`id_caisse`
JOIN `user` ON `user`.`id` = `achat`.`id_user`
---
    public function historique()
    {
        $model = new AchatModel();
        $achats = $model->select(' achat.id, achat.montant_total, caisse.numero, user.email ')->join('caisse', 'caisse.id = achat.id_caisse')->join('user', 'user.id = achat.id_user')->findAll();

INSERT INTO `achat` (`id_caisse`, `id_user`, `montant_total`) VALUES ('1', 1, 185000)
---
    public function finaliser()
    {
        $session = session();
        $panier = $session->get('panier') ?? [];

        if (empty($panier)) {
            return redirect()->to('/achat/saisie');
        }

        $achatModel = new AchatModel();
        $detailModel = new AchatDetailModel();
        $produitModel = new ProduitModel();

        $idCaisse = $session->get('id_caisse') ?? 1;
        $idUser   = $session->get('id_user') ?? 1;

        $total = 0;
        foreach ($panier as $item) {
            $total += $item['prix'] * $item['quantite'];
        }

        try {
            // créer achat
            $achatId = $achatModel->insert([
                'id_caisse' => $idCaisse,
                'id_user' => $idUser,
                'montant_total' => $total
            ], true);

UPDATE `produit` SET `quantite_stock` = quantite_stock - 5
WHERE `id` = '2'
---
                ]);

                // update stock produit
                $produitModel->set('quantite_stock', 'quantite_stock - ' . (int)$item['quantite'], false)
                    ->where('id', $item['id'])
                    ->update();