app/Controllers/AuthController.php

    public function authenticate()
    {
        $model = new \App\Models\UserModel();

        $user = $model
            ->where('email', $this->request->getPost('email'))
            ->first();
---
SELECT *
FROM `user`
WHERE `email` = 'caissier@supermarche.mg'
 LIMIT 1