app/Controllers/CaisseController.php

    public function choix()
    {
        $caisseModel = new CaisseModel();
        $listCaisses = $caisseModel->findAll();
---
SELECT *
FROM `caisse`

    public function validerChoix(){
        $caisseModel = new CaisseModel();
        $idCaisse = $this->request->getPost('id_caisse');
        $caisse = $caisseModel->find($idCaisse);
---
SELECT *
FROM `caisse`
WHERE `caisse`.`id` = '1'